#### ParameterValue Members

---

|  |
| --- |
| ParameterValue Class   Methods   Properties   See Also |

The  ParameterValue  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Copy | Makes an identical copy of the given parameter value. |
| Public method | Dispose | Releases all resources used by the  ParameterValue |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsEqual | Tests equality with another instance of the same class. |
| Public method | IsSameType | Tests another instance is of the same value type. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ParameterValue Class

Autodesk.Revit.DB Namespace